<a href="https://colab.research.google.com/github/yoonyoung27/prac_class/blob/main/tidyverse_prac2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
library(tidyverse)

Warning message in system("timedatectl", intern = TRUE):
“running command 'timedatectl' had status 1”
── Attaching packages ─────────────────────────────────────── tidyverse 1.3.0 ──

✔ ggplot2 3.3.3     ✔ purrr   0.3.4
✔ tibble  3.1.0     ✔ dplyr   1.0.5
✔ tidyr   1.1.3     ✔ stringr 1.4.0
✔ readr   1.4.0     ✔ forcats 0.5.1

── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

#Tidyr
a package for data cleaning

#####* Rule for tidy data

* Every column is variable
* Every row is an observation
* Every cell is a single value

#①Pivoting

###table4a, table4b
dataset on which one variable is spread across multiple columns

In [2]:
table4a

  country     1999   2000
1 Afghanistan    745   2666
2 Brazil       37737  80488
3 China       212258 213766

In [3]:
table4b

  country     1999       2000
1 Afghanistan   19987071   20595360
2 Brazil       172006362  174504898
3 China       1272915272 1280428583

#①.1 pivot_longer()

In [7]:
help(pivot_longer)

In [10]:
tidy4a <- table4a %>%
pivot_longer(c('1999', '2000'), names_to = "year", values_to = "cases")
tidy4a

  country     year cases
1 Afghanistan 1999    745
2 Afghanistan 2000   2666
3 Brazil      1999  37737
4 Brazil      2000  80488
5 China       1999 212258
6 China       2000 213766

In [11]:
tidy4b <- table4b %>%
pivot_longer(c('1999', '2000'), names_to = "year", values_to = "population")
tidy4b

  country     year population
1 Afghanistan 1999   19987071
2 Afghanistan 2000   20595360
3 Brazil      1999  172006362
4 Brazil      2000  174504898
5 China       1999 1272915272
6 China       2000 1280428583

In [14]:
?left_join
left_join(tidy4a, tidy4b)

Joining, by = c("country", "year")

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

* __<left_join(x,y)>__ Add columns from y to x matching rows based on the keys of x

###table2
dataset